{
    "@context": "https://schema.org/",
    "@type": "Recipe",
    "folder": "portuguese_tarts",
    "name": "Jumbo Portuguese Tarts",
    "image": [
      "portuguese_tarts_0.jpg"
    ],
    "author": {
      "@type": "Person",
      "name": "F"
    },
    "datePublished": "2025-07-12",
    "lastMod": "2025-07-12",
    "description": "A jumbo version of the classic Portuguese dessert. These tarts feature a flaky, buttery puff pastry crust filled with a rich, creamy custard. The custard is infused with hints of cinnamon, lemon, and vanilla, and the tarts are baked at a high temperature to achieve their signature caramelized, slightly scorched tops. Perfect for a sweet treat any time of day.",
    "prepTime": "PT5M",
    "cookTime": "PT45M",
    "totalTime": "PT50M",
    "keywords": "portuguese tarts, pastel de nata, portuguese custard tarts, dessert, portuguese cuisine, puff pastry, custard, egg tarts, baking, sweet, pastry, homemade, recipe, cinnamon, lemon, vanilla, flaky pastry, creamy custard, caramelized, baked goods, traditional dessert",
    "recipeYield": "6 servings",
    "recipeCuisine": [
      "Portuguese",
      "European",
      "Western"
    ],
    "recipeCategory": [
      "Dessert",
      "Pastry",
      "Bakery",
      "Sweet Treat",
      "Snack"
    ],
    "nutrition": {
      "@type": "NutritionInformation",
      "calories": "375-475 calories per serving (estimated)"
    },
    "recipeIngredient": [
      "2 sheets Puff Pastry (333g)",
      "",
      "Sugar Syrup:",
      "3/4 cup White Sugar",
      "1/4 cup Water",
      "1 Cinnamon Stick",
      "Rind of 1 Lemon",
      "",
      "Custard:",
      "1/3 cup All-Purpose Flour",
      "Pinch of Salt",
      "1 1/2 cups Milk",
      "6 large Egg Yolks",
      "1 1/2 tsp Vanilla Extract"
    ],
    "ingredientKeywords": [
      "Puff Pastry",
      "Pastry",
      "White Sugar",
      "Sugar",
      "Cinnamon Stick",
      "Lemon",
      "All Purpose Flour",
      "Flour",
      "Plain Flour",
      "Milk",
      "Egg",
      "Egg Yolk",
      "Vanilla Extract"
    ],
    "equipment": [
      "Muffin Tray",
      "Cup Measure",
      "Medium Pot",
      "Sieve"
    ],
    "recipeInstructions": [
      {
        "@type": "HowToStep",
        "text": "Add sugar syrup ingredients to a pot and bring to a boil over medium heat. Boil for about 1m and then take of the heat and let cool.",
        "name": "Create syrup",
        "url": 1
      },
      {
        "@type": "HowToStep",
        "text": "In a medium sized pot, whisk together milk and flour until totally combined. Over a medium heat, whisk constantly until it thickens considerably. Let cool for about 10m.",
        "name": "Prep milk",
        "url": 2
      },
      {
        "@type": "HowToStep",
        "text": "Whisk yolks, milk mix and syrup until combined. Strain through a fine sieve.",
        "name": "Make custard",
        "url": 3
      },
      {
        "@type": "HowToStep",
        "text": "Heat oven to 250C. Grease your cupcake pan with butter. Roll the 2 sheets of puff pastry into 1 big log. It should be about 4cm wide. Cut into about 4cm long chunks. If using shop bought sheets, you'll get 6 nicely sized ones and have some leftover on the edges.",
        "name": "Prep pastry",
        "url": 4
      },
      {
        "@type": "HowToStep",
        "text": "Wet your fingers and press the pastry logs into the cupcake tray to form a cup. Pour custard in about 2/3 of the way up. Bake for 18 minutes.",
        "name": "Prep tarts",
        "url": 5
      },
      {
        "@type": "HowToStep",
        "text": "Let them cool and enjoy!",
        "name": "Serve",
        "url": 6
      }
    ],
    "notes": [
      "Should make about 6 tarts if using a large muffin tray. The muffin tray I have measures 4.5cm deep and 9cm wide. Would probably work better with a deeper but equally wide tray.",
      "Be careful not to overfill the tarts otherwise they will overflow when baked. To try and avoid this, form your pastry and make it go above the top of the tray.",
      "The amount of pastry specified will make pretty thick pastry walls. This is how I like them but you could definitely get away with less pastry.",
      "For a tangy twist add 2 tsp of tamarind paste when whisking in the egg yolks.",
      "Puff pastry sheets I use are about 26cm x 26cm.",
      "You can easily halve the size of these but use the same tray size. For each tart, is 1/12 of the pastry and don't fill them as much.",
      "Greasing the cupcake pan with butter is important for getting a nice browned pastry wall.",
      "For the most ideal result, use slightly sweetened puff pastry. If not using sweetened, at least use butter puff pastry."
    ],
    "relatedRecipes": [
        "puff_pastry"
    ]
  }